In [1]:
import numpy as np
import pandas as pd
import datetime

# Problem Statement 1:
#1) How-to-count-distance-to-the-previous-zero For each value, count the difference of the distance from the previous zero (or the start of #the Series, whichever is closer) and if there are no previous zeros, print the position
#Consider a DataFrame df where there is an integer column {'X'[7, 2, 0, 3, 4, 2, 5, 0, 3, 4]}
#The values should therefore be [1, 2, 0, 1, 2, 3, 4, 0, 1, 2]. Make this a new column 'Y'.

In [2]:
s = pd.Series([7, 2, 0, 3, 4, 2, 5, 0, 3, 4])

(s.groupby(s.eq(0).cumsum().mask(s.eq(0))).cumcount() + 1).mask(s.eq(0), 0).tolist()

#s = [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]
#i = 0
#r = []
#
#for element in s:
#    if element != 0:
#        i += 1
#    else:
#        i = 0
#    r.append(i)
#r

[1, 2, 0, 1, 2, 3, 4, 0, 1, 2]

#2) Create a DatetimeIndex that contains each business day of 2015 and use it to 
     #index a Series of random numbers.

In [3]:
dtix = pd.date_range('2015-01-01', '2015-12-31', freq='D')
ran_val = pd.Series(np.random.rand(len(dtix)), index=dtix)

#3) Find the sum of the values in s for every Wednesday

In [7]:
s=pd.DataFrame(np.random.rand(len(dtix)), index=dtix)
s.reset_index(inplace=True)
s.columns = ['Date','Values']
s['Days'] = s.Date.dt.weekday_name
s.groupby('Days')['Values'].sum()['Wednesday']

27.3262858979619

#4) Average For each calendar month

In [8]:
s['Month'] = s.Date.dt.month
s.groupby('Month')['Values'].mean()

Month
1     0.492446
2     0.424244
3     0.436979
4     0.514870
5     0.479875
6     0.538035
7     0.542736
8     0.496873
9     0.492425
10    0.422521
11    0.528446
12    0.451515
Name: Values, dtype: float64

#5)For each group of four consecutive calendar months in s, find the date on which the highest value occurred.

In [10]:
s=pd.DataFrame(np.random.rand(len(dtix)), index =dtix)
s.groupby(pd.Grouper(freq='4MS',label='right')).max()[:3]

                   0
2015-05-01  0.988091
2015-09-01  0.928078
2016-01-01  0.997888

# Problem Statement 2:
#Read the dataset from the below link

In [2]:
baby_df = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')
baby_df.head(5)

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

#Questions:
#1) Delete unnamed columns

In [3]:
baby_df.drop(baby_df.columns[baby_df.columns.str.contains('Unnamed')],axis = 1, inplace = True)
baby_df.head(5)

      Id     Name  Year Gender State  Count
0  11350     Emma  2004      F    AK     62
1  11351  Madison  2004      F    AK     48
2  11352   Hannah  2004      F    AK     46
3  11353    Grace  2004      F    AK     44
4  11354    Emily  2004      F    AK     41

#2) Show the distribution of male and female

In [4]:
baby_df.groupby('Gender').count()

            Id    Name    Year   State   Count
Gender
F       558846  558846  558846  558846  558846
M       457549  457549  457549  457549  457549

In [6]:
baby_df.groupby('Gender')['Count'].sum()

Gender
F    16380293
M    19041199
Name: Count, dtype: int64

#3) Show the top 5 most preferred names

In [17]:
baby_df.groupby(['Name'])['Name'].count().sort_values(ascending = False).head(5)
#baby_df['Name'].value_counts().head(5)

Name
Riley     1112
Avery     1080
Jordan    1073
Peyton    1064
Hayden    1049
Name: Name, dtype: int64

#4) What is the median name occurrence in the dataset

In [7]:
import statistics
statistics.median(baby_df['Name'])

'Jocelyn'

#5) Distribution of male and female born count by states

In [29]:
baby_df.groupby(['Gender','State'])['Count'].agg({'Total count' : sum})

C:\Users\Anu\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: using a dict on a Series for aggregation
is deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

              Total count
Gender State
F      AK           26250
       AL          215308
       AR          129712
       AZ          368567
       CA         2414063
       CO          260805
       CT          141350
       DC           35276
       DE           31312
       FL          915422
       GA          549637
       HI           37279
       IA          144764
       ID           72808
       IL          695312
       IN          344962
       KS          147216
       KY          210201
       LA          221859
       MA          294236
       MD          269915
       ME           43718
       MI          480990
       MN          276884
       MO          307848
       MS          127343
       MT           31622
       NC          501151
       ND           30054
       NE           88998
...                   ...
M      ME           55650
       MI          557090
       MN          318917
       MO          364924
       MS          160800
       MT           44143
       NC          577529
       ND           39507
       NE          112369
       NH           56482
       NJ          487900
       NM          113542
       NV          156037
       NY         1172145
       OH          688343
       OK          228613
       OR          209445
       PA          682709
       RI           47939
       SC          237442
       SD           45443
       TN          398615
       TX         2005394
       UT          245324
       VA          466873
       VT           21353
       WA          395377
       WI          311758
       WV           93557
       WY           21912

[102 rows x 1 columns]